In [1]:
# usando o https://movielens.org/ & conectando com o GitHub da Alura
# para isso devemos usar uma biblioteca
import pandas as pd
# pegando os filmes
url = "https://raw.githubusercontent.com/alura-cursos/introducao-a-data-science/master/aula2.1/movies.csv"
dataFilmes = pd.read_csv(url) # Data Frame
dataFilmes.head() # pega apenas os 5 primeiros, só para ter uma ideia

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [2]:
dataFilmes.columns = ['filmeId', 'título', 'gênero']
dataFilmes.head()

,filmeId,título,gênero
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
# pegando as avaliações
uri = "https://raw.githubusercontent.com/alura-cursos/introducao-a-data-science/master/aula1.2/ratings.csv"
dataNotas = pd.read_csv(uri) # Data Frame
dataNotas.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
dataNotas.columns = ["usuárioId", "filmeId", "notas", "momento"] # o momento é o tempo da avaliação
dataNotas.head()

   usuárioId  filmeId  notas    momento
0          1        1    4.0  964982703
1          1        3    4.0  964981247
2          1        6    4.0  964982224
3          1       47    5.0  964983815
4          1       50    5.0  964982931

In [5]:
dataNotas["notas"].head() # data serie

0    4.0
1    4.0
2    4.0
3    5.0
4    5.0
Name: notas, dtype: float64

In [6]:
dataNotas["notas"].unique() # mostra que as notas que vão de 0 até 5

array([4. , 5. , 3. , 2. , 1. , 4.5, 3.5, 2.5, 0.5, 1.5])

In [7]:
dataNotas["notas"].mean() # pega a média das notas

3.501556983616962

In [8]:
dataNotas.describe() # vai descrever (fazer um resumo dos dados)

# média => (1 + 3 + 5) / 3 => 3
# mas, para salário e outras coisas não é muito bom, para isso usa a MEDIANA (50% 50%)

           usuárioId        filmeId          notas       momento
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09